In [1]:
import pandas as pd
import numpy as np
#mencetak versi pandas dan numpy yang akan digunakan
print(pd.__version__)
print(np.__version__)

1.2.4
1.20.1

In [2]:
#data frame terdiri dari 10 baris dan 5 kolom
n_rows = 10
n_cols = 5
#kolom akan diberi label A B C D dan E
cols = tuple('ABCDE')
df = pd.DataFrame(np.random.randint(1,20,size=(n_rows,n_cols)),columns=cols)
df

    A   B   C   D   E
0  10   2   4   4  10
1   3  12  18  13  18
2  10  10   6  10   6
3  17  15  15  15   5
4   2   5  12   7  13
5   7  17  10   5  10
6   8  10   4  17  18
7   7  19   9   3   9
8  15   6  14  18  14
9   1  14   1  15  18

In [3]:
#.shape digunakan untuk mengecek bentuk dari dataframe 
df.shape

(10, 5)

In [4]:
#variabel proporsi disini memiliki arti kita ingin membagi 70% dari data frame utama ke data frame pertama dan 30% sisanya di dataframe kedua
proporsi = 0.7
#method .sample() digunakan untuk mengambil baris secara acak sebanyak proporsi yang sudah ditentukan sebelumnya
df_1 = df.sample(frac=proporsi)
#method .drop() digunakan untuk menghapus baris-baris yang sudah diadopsi di df_1
df_2 = df.drop(df_1.index)
#mencetak shape dari ketua data frame
print(f' d_1 shape : {df_1.shape}')
print(f' d_2 shape : {df_2.shape}')

 d_1 shape : (7, 5)
 d_2 shape : (3, 5)

In [5]:
#memanggil isi dari df_1
df_1

    A   B   C   D   E
9   1  14   1  15  18
2  10  10   6  10   6
8  15   6  14  18  14
7   7  19   9   3   9
5   7  17  10   5  10
6   8  10   4  17  18
3  17  15  15  15   5

In [6]:
#memanggil isi dari df_2
df_2

    A   B   C   D   E
0  10   2   4   4  10
1   3  12  18  13  18
4   2   5  12   7  13

In [9]:
import pandas as pd
#mencetak versi pandas yang akan digunakan
print(pd.__version__)

1.2.4

In [10]:
#data titanicfull.csv bisa didownload dari kaggle
df = pd.read_csv('./titanicfull.csv')
# mengatur nama kolom
df.columns = ['Pclass', 'Survival status','full Name','Sex ',' Age','Sib SP','Parch','Ticket','Fare','Cabin','Embarked']
df_backup = df.copy(deep=True)
#mengambil 5 data pertama dari data frame
df.head()

,Pclass,Survival status,full Name,Sex,Age,Sib SP,Parch,Ticket,Fare,Cabin,Embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

In [11]:
#mengganti spasi dengan_ serta menyeragamkan semua karakter upper case menjadi lowercase
df.columns = df.columns.str.replace(' ','_').str.lower()
#mengambil 5 data pertama dari data frame
df.head()

,pclass,survival_status,full_name,sex_,_age,sib_sp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

In [12]:
df = df_backup.copy(deep=True)
#method .str.strip() akan memotong kelebihan spasi pada kolom dataframe
df.columns = df.columns.str.lower().str.strip().str.replace(' ','_')
df.head()

,pclass,survival_status,full_name,sex,age,sib_sp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

In [13]:
import pandas as pd
import numpy as np
#mencetak versi pandas dan numpy yang akan digunakan
print(pd.__version__)
print(np.__version__)

1.2.4
1.20.1

In [14]:
#data frame terdiri dari 10 baris dan 5 kolom
n_rows = 10
n_cols = 5
#kolom akan diberi label A B C D dan E
cols = tuple('ABCDE')
df = pd.DataFrame(np.random.randint(1,20,size=(n_rows,n_cols)),columns=cols)
df

    A   B   C   D   E
0   4  10   1   7  18
1  10  18   4   4  12
2  12   4  18  17  15
3  10   4   7  16   6
4  11   6  10   4   7
5  18  18   4  10  12
6  18  11  19  16   5
7  12   7   9  12   3
8  17   9   3  14  16
9  12   7   4  10  14

In [15]:
#parameter pertama pada loc digunakan untuk mengatur baris
#parameter kedua pada loc digunakan untuk mengatur kolom
df.loc[[0,3,4],['B','E']]

    B   E
0  10  18
3   4   6
4   6   7

In [16]:
#menampilkan baris yang nilai kolom B nya lebih besar dari 10
#menampilkan hanya kolom B D dan E 
df.loc[df['B']>10,['B','D','E']]

    B   D   E
1  18   4  12
5  18  10  12
6  11  16   5

In [17]:
#melakukan slicing pada data frame
#pada bagian baris dilakukan slicing dimulai dari baris ke-0 sampai dengan baris ke-4
#pada bagian kolom dilakukan slicing dimulai dari kolom B sampai dengan kolom D
#pada loc start index dan end index bersifat inclusive yang berarti diikutsertakan pada saat pengambilan data
df.loc[0:4,'B':'D']

    B   C   D
0  10   1   7
1  18   4   4
2   4  18  17
3   4   7  16
4   6  10   4

In [18]:
import pandas as pd
#mencetak versi pandas yang akan digunakan
print(pd.__version__)

1.2.4

In [19]:
#menyiapkan kolom dan baris pada DataFrame
data = {'day':[1,2,10,25,12],
       'month':[1,2,4,5,6],
       'year':[2000,2001,2010,2015,2020]}
df = pd.DataFrame(data)
df

   day  month  year
0    1      1  2000
1    2      2  2001
2   10      4  2010
3   25      5  2015
4   12      6  2020

In [20]:
#mendefinisikan kolom penanggalan
df['penanggalan'] = pd.to_datetime(df[['day','month','year']])
df

   day  month  year penanggalan
0    1      1  2000  2000-01-01
1    2      2  2001  2001-02-02
2   10      4  2010  2010-04-10
3   25      5  2015  2015-05-25
4   12      6  2020  2020-06-12

In [21]:
#melihat tipe data di dalam dataframe
df.dtypes

day                     int64
month                   int64
year                    int64
penanggalan    datetime64[ns]
dtype: object